app/controllers/api/beacons_controller.rb

	def create
		beacon = current_user.build_beacon(beacon_params)

		if beacon.save
			render json: { status: 0, data: beacon }
		else
			render json: { status: 2, messages: beacon.errros.first.full_message }
---
INSERT INTO "beacons" ("unique_id", "minor", "major", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["unique_id", "B9407F30-F5F8-466E-AFF9-25556B57FE6D"], ["minor", "37813"], ["major", "47798"], ["created_at", "2016-10-18 15:49:49.952573"], ["updated_at", "2016-10-18 15:49:49.952573"]]
UPDATE "beacons" SET "user_id" = $1, "updated_at" = $2 WHERE "beacons"."id" = $3  [["user_id", nil], ["updated_at", "2016-10-18 19:01:44.756765"], ["id", 1]]
SELECT  "beacons".* FROM "beacons" WHERE "beacons"."user_id" = $1 LIMIT 1  [["user_id", 1]]

	def update
		@beacon = Beacon.find(params[:id])

		if @beacon.update_attributes(beacon_params)
---
SELECT  "beacons".* FROM "beacons" WHERE "beacons"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "beacons" SET "minor" = $1, "major" = $2, "pet_image" = $3, "updated_at" = $4 WHERE "beacons"."id" = $5  [["minor", "3"], ["major", "2"], ["pet_image", "00eb65d2-b5e0-4e1f-afd0-a5d5767f37f1.png"], ["updated_at", "2016-11-25 20:19:31.986610"], ["id", 6]]