app/controllers/api/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 69]]
INSERT INTO "comments" ("user_id", "description", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 23], ["description", "test comment"], ["post_id", 69], ["created_at", "2016-10-20 19:48:13.709359"], ["updated_at", "2016-10-20 19:48:13.709359"]]
---
	def create
    	post = Post.find(params[:post_id])
        comment = post.comments.build(:user_id => current_user.id, :description => params[:comment][:description])

		if comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 9]]
---
	def index
		post = Post.find(params[:post_id])