app/controllers/api/likes_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 69]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["created_at", "2016-10-24 19:06:03.116804"], ["updated_at", "2016-10-24 19:06:03.116804"]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 78]]
---
	def create
        post = Post.find(params[:post_id])

        if !current_user.likes?(post)
        	like = post.likes.build(:user => current_user)
        	like.save!
        	render json: { status: 0, message: nil, likes: post.likes.count }, status: :ok

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = 7 AND "likes"."post_id" = 6 LIMIT 1
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 9]]
---
    def destroy
        post = Post.find(params[:post_id])
        like = Like.find_by(user: current_user, post: post)

        if like.destroy

SELECT "likes".* FROM "likes"
---
    def index
  		likes = Like.all