app/controllers/api/posts_controller.rb

	def create
		post = current_user.posts.build(post_params)

		if post.save
---
INSERT INTO "posts" ("description", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "I was created because the beacon told me so"], ["image", ""], ["user_id", 1], ["created_at", "2016-10-01 19:03:25.719534"], ["updated_at", "2016-10-01 19:03:25.719534"]]

	def other_posts
		user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]