app/controllers/api/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
  def create
    user = User.find(params[:user_id])