app/controllers/api/users_controller.rb

	def create
		user = User.new(user_params)

		if user.save
---
INSERT INTO "users" ("email", "password_digest", "pet_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def update
		if @user.update_attributes(user_update_params)
---
UPDATE "users" SET "name" = $1, "pet_name" = $2, "birth_date" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["name", "Yasmin"], ["pet_name", "Kedim"], ["birth_date", "1995-07-07 00:00:00.000000"], ["updated_at", "2016-10-20 14:12:20.957953"], ["id", 17]]